
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 0 to change, 10 to destroy.</code></pre>

* Create
  * google_service_account.terraform_executor
  * google_service_account_iam_binding.terraform_workload_identity
  * kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads
  * kubernetes_cluster_role.access_signify_secrets_trusted_workloads
  * kubernetes_cluster_role.access_signify_secrets_untrusted_workloads
  * kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads
  * kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads
  * kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads
  * kubernetes_service_account.trusted_workload_terraform_executor
  * kubernetes_service_account.untrusted_workload_terraform_executor
* Delete
  * module.tekton_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
  * module.terraform_executor_gcp_service_account.google_project_iam_member.terraform_executor_owner
  * module.terraform_executor_gcp_service_account.google_service_account.terraform_executor
  * module.terraform_executor_gcp_service_account.google_service_account_iam_binding.terraform_workload_identity
  * module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
  * module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
* Replace
  * google_project_iam_member.terraform_executor_owner


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.terraform_executor_owner must be replaced
-/+ resource "google_project_iam_member" "terraform_executor_owner" {
      ~ etag    = "BwX+pK6YmJk=" -> (known after apply)
      ~ id      = "sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ project = "sap-kyma-prow-workloads" -> "sap-kyma-prow" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_service_account.terraform_executor will be created
  + resource "google_service_account" "terraform_executor" {
      + account_id   = "terraform-executor"
      + description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled     = false
      + display_name = "terraform-executor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.terraform_workload_identity will be created
  + resource "google_service_account_iam_binding" "terraform_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_pjtester_secrets_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-pjtester-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "pjtester-kubeconfig",
              + "pjtester-github-oauth-token",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role.access_signify_secrets_trusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_signify_secrets_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "signify-dev-secret",
              + "signify-prod-secret",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role.access_signify_secrets_untrusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_signify_secrets_untrusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "signify-dev-secret",
              + "signify-prod-secret",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_pjtester_secrets_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-pjtester-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-pjtester-secrets"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_signify_prod_secret_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-signify-secrets"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_signify_prod_secret_untrusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-signify-secrets"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_service_account.trusted_workload_terraform_executor will be created
  + resource "kubernetes_service_account" "trusted_workload_terraform_executor" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.untrusted_workload_terraform_executor will be created
  + resource "kubernetes_service_account" "untrusted_workload_terraform_executor" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be destroyed
  # (because kubernetes_secret.terraform_executor is not in configuration)
  - resource "kubernetes_secret" "terraform_executor" {
      - data                           = (sensitive value)
      - id                             = "default/terraform-executor" -> null
      - immutable                      = false -> null
      - type                           = "kubernetes.io/service-account-token" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/service-account.name" = "terraform-executor"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "156951514" -> null
          - uid              = "4e5d471e-2e95-42ea-9d2e-88f95c593061" -> null
        }
    }

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be destroyed
  # (because kubernetes_service_account.terraform_executor is not in configuration)
  - resource "kubernetes_service_account" "terraform_executor" {
      - automount_service_account_token = true -> null
      - id                              = "default/terraform-executor" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "156951508" -> null
          - uid              = "4c5c30a3-944b-450e-a833-bb9128c1cacf" -> null
        }
    }

  # module.terraform_executor_gcp_service_account.google_project_iam_member.terraform_executor_owner will be destroyed
  # (because google_project_iam_member.terraform_executor_owner is not in configuration)
  - resource "google_project_iam_member" "terraform_executor_owner" {
      - etag    = "BwX+pK6Sluk=" -> null
      - id      = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - project = "sap-kyma-prow" -> null
      - role    = "roles/owner" -> null
    }

  # module.terraform_executor_gcp_service_account.google_service_account.terraform_executor will be destroyed
  # (because google_service_account.terraform_executor is not in configuration)
  - resource "google_service_account" "terraform_executor" {
      - account_id   = "terraform-executor" -> null
      - description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity." -> null
      - disabled     = false -> null
      - display_name = "terraform-executor" -> null
      - email        = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - id           = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - name         = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - project      = "sap-kyma-prow" -> null
      - unique_id    = "103850067121674389188" -> null
    }

  # module.terraform_executor_gcp_service_account.google_service_account_iam_binding.terraform_workload_identity will be destroyed
  # (because google_service_account_iam_binding.terraform_workload_identity is not in configuration)
  - resource "google_service_account_iam_binding" "terraform_workload_identity" {
      - etag               = "BwX+pK5Qx+c=" -> null
      - id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> null
      - members            = [
          - "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
        ] -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
    }

  # module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be destroyed
  # (because kubernetes_secret.terraform_executor is not in configuration)
  - resource "kubernetes_secret" "terraform_executor" {
      - data                           = (sensitive value)
      - id                             = "default/terraform-executor" -> null
      - immutable                      = false -> null
      - type                           = "kubernetes.io/service-account-token" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/service-account.name" = "terraform-executor"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "613225574" -> null
          - uid              = "010a72b1-5a7f-46c6-9b83-7de76e11d2b0" -> null
        }
    }

  # module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be destroyed
  # (because kubernetes_service_account.terraform_executor is not in configuration)
  - resource "kubernetes_service_account" "terraform_executor" {
      - automount_service_account_token = true -> null
      - id                              = "default/terraform-executor" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "613225441" -> null
          - uid              = "05758180-7aea-40e1-a56b-e8c8e0ffbede" -> null
        }
    }

  # module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be destroyed
  # (because kubernetes_secret.terraform_executor is not in configuration)
  - resource "kubernetes_secret" "terraform_executor" {
      - data                           = (sensitive value)
      - id                             = "default/terraform-executor" -> null
      - immutable                      = false -> null
      - type                           = "kubernetes.io/service-account-token" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/service-account.name" = "terraform-executor"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "609170015" -> null
          - uid              = "aca41ca8-6786-473d-a20b-9a66bb357b8e" -> null
        }
    }

  # module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be destroyed
  # (because kubernetes_service_account.terraform_executor is not in configuration)
  - resource "kubernetes_service_account" "terraform_executor" {
      - automount_service_account_token = true -> null
      - id                              = "default/terraform-executor" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "609169953" -> null
          - uid              = "7421ea17-2d20-463e-ab19-078c924130a4" -> null
        }
    }

Plan: 11 to add, 0 to change, 10 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

```



<!-- github-comment: {"Command":"plan","PRNumber":7883,"Program":"tfcmt","SHA1":"6d63b2c6299367744b285434878890535eac6658","Vars":{}} -->